Revit 2026 API

# PathOfTravelCalculationServerIds Class

---

Ids for external servers implementing path of travel calculations.

SystemObject Autodesk.Revit.DB.AnalysisPathOfTravelCalculationServerIds

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PathOfTravelCalculationServerIds
```
```vb
Public NotInheritable Class PathOfTravelCalculationServerIds
```
```cpp
public ref class PathOfTravelCalculationServerIds abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PathOfTravelCalculationServerIds = class end
```

The PathOfTravelCalculationServerIds type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DefaultPathOfTravelCalculationGUID | GUID to represent the default calculation server id. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace